<a href="https://colab.research.google.com/github/waqqasansari/Machine_Learning_Probs/blob/master/Pandas_operation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

highly based on this article :-https://www.geeksforgeeks.org/python-pandas-merging-joining-and-concatenating/

In [1]:
#import essential libraries
import pandas as pd
import numpy as np

In [5]:
#creating a data dictionary containing of employee data

data1 = {'Name':['waqqas', 'raj', 'huma', 'rekha'],
         'Age':['23', '34', '21', '25'],
         'City':['Rudauli', 'kanpur', 'lucknow', 'goa'],
         'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

#creating a data dictionary containing of employee data
data2 = {'Name':['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'], 
        'Age':[17, 14, 12, 52], 
        'City':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

#Convert dictionary in to Dataframe
df1 = pd.DataFrame(data1, index=[0,1,2,3])
df2 = pd.DataFrame(data2, index=[4,5,6,7])

print(df1, "\n\n", df2)

     Name Age     City Qualification
0  waqqas  23  Rudauli           Msc
1     raj  34   kanpur            MA
2    huma  21  lucknow           MCA
3   rekha  25      goa           Phd

      Name  Age       City Qualification
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

##Apply .concat on both dataframe

In [6]:
oc1 = pd.concat([df1, df2])
oc1

     Name Age       City Qualification
0  waqqas  23    Rudauli           Msc
1     raj  34     kanpur            MA
2    huma  21    lucknow           MCA
3   rekha  25        goa           Phd
4    Abhi  17     Nagpur         Btech
5  Ayushi  14     Kanpur           B.A
6  Dhiraj  12  Allahabad          Bcom
7  Hitesh  52    Kannuaj        B.hons

##Concatenating DataFrame by setting logic on axes

In [15]:
#creating a data dictionary containing of employee data
data1 = {'Name':['waqqas', 'raj', 'huma', 'rekha'],
         'Age':['23', '34', '21', '25'],
         'City':['Rudauli', 'kanpur', 'lucknow', 'goa'],
         'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
         'Mobile_no.':['453453', '2345','34523', '2345']}

#creating a data dictionary containing of employee data
data2 = {'Name':['waqqas', 'raj', 'Dhiraj', 'Hitesh'], 
        'Age':['23', '34', '12', '52'], 
        'City':['Rudauli', 'kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'Bcom', 'B.hons'],
         'salary':['20000','30000','40000','12000']}


#Convert dictionary in to Dataframe
df1 = pd.DataFrame(data1, index=[0,1,2,3])
df2 = pd.DataFrame(data2, index=[0,1,6,7])

print(df1, "\n\n", df2)

     Name Age     City Qualification Mobile_no.
0  waqqas  23  Rudauli           Msc     453453
1     raj  34   kanpur            MA       2345
2    huma  21  lucknow           MCA      34523
3   rekha  25      goa           Phd       2345

      Name Age       City Qualification salary
0  waqqas  23    Rudauli           Msc  20000
1     raj  34     kanpur            MA  30000
6  Dhiraj  12  Allahabad          Bcom  40000
7  Hitesh  52    Kannuaj        B.hons  12000

In [16]:
# applying concat with axes
# join = 'inner', Taking the intersection
oc1 = pd.concat([df1, df2], axis=1, join='inner')
oc1

     Name Age     City Qualification  ... Age     City Qualification salary
0  waqqas  23  Rudauli           Msc  ...  23  Rudauli           Msc  20000
1     raj  34   kanpur            MA  ...  34   kanpur            MA  30000

[2 rows x 10 columns]

In [17]:
# applying concat with axes
# join = 'outer', Taking the union of them
oc1 = pd.concat([df1, df2], axis=1, join='outer')
oc1

     Name  Age     City Qualification  ...  Age       City Qualification salary
0  waqqas   23  Rudauli           Msc  ...   23    Rudauli           Msc  20000
1     raj   34   kanpur            MA  ...   34     kanpur            MA  30000
2    huma   21  lucknow           MCA  ...  NaN        NaN           NaN    NaN
3   rekha   25      goa           Phd  ...  NaN        NaN           NaN    NaN
6     NaN  NaN      NaN           NaN  ...   12  Allahabad          Bcom  40000
7     NaN  NaN      NaN           NaN  ...   52    Kannuaj        B.hons  12000

[6 rows x 10 columns]

In [24]:
oc2 = pd.concat([df1, df2], axis=1)
oc2

     Name  Age     City Qualification  ...  Age       City Qualification salary
0  waqqas   23  Rudauli           Msc  ...   23    Rudauli           Msc  20000
1     raj   34   kanpur            MA  ...   34     kanpur            MA  30000
2    huma   21  lucknow           MCA  ...  NaN        NaN           NaN    NaN
3   rekha   25      goa           Phd  ...  NaN        NaN           NaN    NaN
6     NaN  NaN      NaN           NaN  ...   12  Allahabad          Bcom  40000
7     NaN  NaN      NaN           NaN  ...   52    Kannuaj        B.hons  12000

[6 rows x 10 columns]

##Concatenating DataFrame using .append()

In [25]:
#creating a data dictionary containing of employee data

data1 = {'Name':['waqqas', 'raj', 'huma', 'rekha'],
         'Age':['23', '34', '21', '25'],
         'City':['Rudauli', 'kanpur', 'lucknow', 'goa'],
         'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

#creating a data dictionary containing of employee data
data2 = {'Name':['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'], 
        'Age':[17, 14, 12, 52], 
        'City':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

#Convert dictionary in to Dataframe
df1 = pd.DataFrame(data1, index=[0,1,2,3])
df2 = pd.DataFrame(data2, index=[4,5,6,7])

print(df1, "\n\n", df2)

     Name Age     City Qualification
0  waqqas  23  Rudauli           Msc
1     raj  34   kanpur            MA
2    huma  21  lucknow           MCA
3   rekha  25      goa           Phd

      Name  Age       City Qualification
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [26]:
# using append function
 
oc1 = df1.append(df2)
oc1

     Name Age       City Qualification
0  waqqas  23    Rudauli           Msc
1     raj  34     kanpur            MA
2    huma  21    lucknow           MCA
3   rekha  25        goa           Phd
4    Abhi  17     Nagpur         Btech
5  Ayushi  14     Kanpur           B.A
6  Dhiraj  12  Allahabad          Bcom
7  Hitesh  52    Kannuaj        B.hons

##Concatenating DataFrame by ignoring indexes :

In [27]:
#creating a data dictionary containing of employee data
data1 = {'Name':['waqqas', 'raj', 'huma', 'rekha'],
         'Age':['23', '34', '21', '25'],
         'City':['Rudauli', 'kanpur', 'lucknow', 'goa'],
         'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
         'Mobile_no.':['453453', '2345','34523', '2345']}

#creating a data dictionary containing of employee data
data2 = {'Name':['waqqas', 'raj', 'Dhiraj', 'Hitesh'], 
        'Age':['23', '34', '12', '52'], 
        'City':['Rudauli', 'kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'Bcom', 'B.hons'],
         'salary':['20000','30000','40000','12000']}


#Convert dictionary in to Dataframe
df1 = pd.DataFrame(data1, index=[0,1,2,3])
df2 = pd.DataFrame(data2, index=[0,1,6,7])

print(df1, "\n\n", df2)

     Name Age     City Qualification Mobile_no.
0  waqqas  23  Rudauli           Msc     453453
1     raj  34   kanpur            MA       2345
2    huma  21  lucknow           MCA      34523
3   rekha  25      goa           Phd       2345

      Name Age       City Qualification salary
0  waqqas  23    Rudauli           Msc  20000
1     raj  34     kanpur            MA  30000
6  Dhiraj  12  Allahabad          Bcom  40000
7  Hitesh  52    Kannuaj        B.hons  12000

In [28]:
# using ignore_index
oc1 = pd.concat([df1, df2], ignore_index=True)
oc1

     Name Age       City Qualification Mobile_no. salary
0  waqqas  23    Rudauli           Msc     453453    NaN
1     raj  34     kanpur            MA       2345    NaN
2    huma  21    lucknow           MCA      34523    NaN
3   rekha  25        goa           Phd       2345    NaN
4  waqqas  23    Rudauli           Msc        NaN  20000
5     raj  34     kanpur            MA        NaN  30000
6  Dhiraj  12  Allahabad          Bcom        NaN  40000
7  Hitesh  52    Kannuaj        B.hons        NaN  12000

##Concatenating DataFrame with group keys :

In [29]:
#creating a data dictionary containing of employee data

data1 = {'Name':['waqqas', 'raj', 'huma', 'rekha'],
         'Age':['23', '34', '21', '25'],
         'City':['Rudauli', 'kanpur', 'lucknow', 'goa'],
         'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

#creating a data dictionary containing of employee data
data2 = {'Name':['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'], 
        'Age':[17, 14, 12, 52], 
        'City':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

#Convert dictionary in to Dataframe
df1 = pd.DataFrame(data1, index=[0,1,2,3])
df2 = pd.DataFrame(data2, index=[4,5,6,7])

print(df1, "\n\n", df2)

     Name Age     City Qualification
0  waqqas  23  Rudauli           Msc
1     raj  34   kanpur            MA
2    huma  21  lucknow           MCA
3   rekha  25      goa           Phd

      Name  Age       City Qualification
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [31]:
oc1 = pd.concat([df1, df2], keys=['A','B'])
oc1

       Name Age       City Qualification
A 0  waqqas  23    Rudauli           Msc
  1     raj  34     kanpur            MA
  2    huma  21    lucknow           MCA
  3   rekha  25        goa           Phd
B 4    Abhi  17     Nagpur         Btech
  5  Ayushi  14     Kanpur           B.A
  6  Dhiraj  12  Allahabad          Bcom
  7  Hitesh  52    Kannuaj        B.hons

##Concatenating with mixed ndims :

In [33]:
data1 = {'Name':['waqqas', 'raj', 'huma', 'rekha'],
         'Age':['23', '34', '21', '25'],
         'City':['Rudauli', 'kanpur', 'lucknow', 'goa'],
         'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

#Convert dictionary in to Dataframe
df1 = pd.DataFrame(data1, index=[0,1,2,3])

# creating a series
s1 = pd.Series([1000, 2000, 3000, 4000], name='Salary')

print(df1, "\n\n", s1)

     Name Age     City Qualification
0  waqqas  23  Rudauli           Msc
1     raj  34   kanpur            MA
2    huma  21  lucknow           MCA
3   rekha  25      goa           Phd

 0    1000
1    2000
2    3000
3    4000
Name: Salary, dtype: int64

In [34]:
# combining series and dataframe
oc1 = pd.concat([df1, s1], axis=1)
oc1

     Name Age     City Qualification  Salary
0  waqqas  23  Rudauli           Msc    1000
1     raj  34   kanpur            MA    2000
2    huma  21  lucknow           MCA    3000
3   rekha  25      goa           Phd    4000

#Merging DataFrame
There are four basic ways to handle the join (inner, left, right, and outer), depending on which rows must retain their data.

In [35]:
# Define a dictionary containing employee data 
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32],} 
   
# Define a dictionary containing employee data 
data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
 
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2) 
  
 
print(df, "\n\n", df1)

  key    Name  Age
0  K0     Jai   27
1  K1  Princi   24
2  K2  Gaurav   22
3  K3    Anuj   32

   key    Address Qualification
0  K0     Nagpur         Btech
1  K1     Kanpur           B.A
2  K2  Allahabad          Bcom
3  K3    Kannuaj        B.hons

In [36]:
#Now we are using .merge() with one unique key combination

# using .merge() function
res = pd.merge(df, df1, on='key')
 
res

  key    Name  Age    Address Qualification
0  K0     Jai   27     Nagpur         Btech
1  K1  Princi   24     Kanpur           B.A
2  K2  Gaurav   22  Allahabad          Bcom
3  K3    Anuj   32    Kannuaj        B.hons

In [37]:
#Merging dataframe using multiple join keys.
# Define a dictionary containing employee data 
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K1', 'K0', 'K1'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32],} 
   
# Define a dictionary containing employee data 
data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K0', 'K0', 'K0'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
 
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2) 
  
 
print(df, "\n\n", df1)

  key key1    Name  Age
0  K0   K0     Jai   27
1  K1   K1  Princi   24
2  K2   K0  Gaurav   22
3  K3   K1    Anuj   32

   key key1    Address Qualification
0  K0   K0     Nagpur         Btech
1  K1   K0     Kanpur           B.A
2  K2   K0  Allahabad          Bcom
3  K3   K0    Kannuaj        B.hons

In [38]:
# merging dataframe using multiple keys
res1 = pd.merge(df, df1, on=['key', 'key1'])
 
res1

  key key1    Name  Age    Address Qualification
0  K0   K0     Jai   27     Nagpur         Btech
1  K2   K0  Gaurav   22  Allahabad          Bcom

#Merging dataframe using "how" in an argument:

In [39]:
# Define a dictionary containing employee data 
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K1', 'K0', 'K1'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32],} 
   
# Define a dictionary containing employee data 
data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K0', 'K0', 'K0'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
 
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2) 
  
 
print(df, "\n\n", df1)

  key key1    Name  Age
0  K0   K0     Jai   27
1  K1   K1  Princi   24
2  K2   K0  Gaurav   22
3  K3   K1    Anuj   32

   key key1    Address Qualification
0  K0   K0     Nagpur         Btech
1  K1   K0     Kanpur           B.A
2  K2   K0  Allahabad          Bcom
3  K3   K0    Kannuaj        B.hons

In [40]:
# using keys from left frame
res = pd.merge(df, df1, how='left', on=['key', 'key1'])
 
res

  key key1    Name  Age    Address Qualification
0  K0   K0     Jai   27     Nagpur         Btech
1  K1   K1  Princi   24        NaN           NaN
2  K2   K0  Gaurav   22  Allahabad          Bcom
3  K3   K1    Anuj   32        NaN           NaN

In [41]:
# using keys from right frame
res1 = pd.merge(df, df1, how='right', on=['key', 'key1'])
 
res1

  key key1    Name   Age    Address Qualification
0  K0   K0     Jai  27.0     Nagpur         Btech
1  K2   K0  Gaurav  22.0  Allahabad          Bcom
2  K1   K0     NaN   NaN     Kanpur           B.A
3  K3   K0     NaN   NaN    Kannuaj        B.hons

In [42]:
# getting union  of keys
res2 = pd.merge(df, df1, how='outer', on=['key', 'key1'])
 
res2

  key key1    Name   Age    Address Qualification
0  K0   K0     Jai  27.0     Nagpur         Btech
1  K1   K1  Princi  24.0        NaN           NaN
2  K2   K0  Gaurav  22.0  Allahabad          Bcom
3  K3   K1    Anuj  32.0        NaN           NaN
4  K1   K0     NaN   NaN     Kanpur           B.A
5  K3   K0     NaN   NaN    Kannuaj        B.hons

In [43]:
# getting intersection of keys
res3 = pd.merge(df, df1, how='inner', on=['key', 'key1'])
 
res3

  key key1    Name  Age    Address Qualification
0  K0   K0     Jai   27     Nagpur         Btech
1  K2   K0  Gaurav   22  Allahabad          Bcom

#Joining DataFrame

In [44]:
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32]} 
    
# Define a dictionary containing employee data 
data2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']} 
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=['K0', 'K1', 'K2', 'K3'])
  
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=['K0', 'K2', 'K3', 'K4'])
 
 
print(df, "\n\n", df1)

      Name  Age
K0     Jai   27
K1  Princi   24
K2  Gaurav   22
K3    Anuj   32

       Address Qualification
K0  Allahabad           MCA
K2    Kannuaj           Phd
K3  Allahabad          Bcom
K4    Kannuaj        B.hons

In [45]:
# joining dataframe
res = df.join(df1)
 
res

      Name  Age    Address Qualification
K0     Jai   27  Allahabad           MCA
K1  Princi   24        NaN           NaN
K2  Gaurav   22    Kannuaj           Phd
K3    Anuj   32  Allahabad          Bcom

In [46]:
# getting union
res1 = df.join(df1, how='outer')
 
res1

      Name   Age    Address Qualification
K0     Jai  27.0  Allahabad           MCA
K1  Princi  24.0        NaN           NaN
K2  Gaurav  22.0    Kannuaj           Phd
K3    Anuj  32.0  Allahabad          Bcom
K4     NaN   NaN    Kannuaj        B.hons

#Joining dataframe using on in an argument

In [47]:
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32],
        'Key':['K0', 'K1', 'K2', 'K3']} 
    
# Define a dictionary containing employee data 
data2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']} 
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
  
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=['K0', 'K2', 'K3', 'K4'])
 
 
print(df, "\n\n", df1)

     Name  Age Key
0     Jai   27  K0
1  Princi   24  K1
2  Gaurav   22  K2
3    Anuj   32  K3

       Address Qualification
K0  Allahabad           MCA
K2    Kannuaj           Phd
K3  Allahabad          Bcom
K4    Kannuaj        B.hons

In [48]:
# using on argument in join
res2 = df.join(df1, on='Key')
 
res2

     Name  Age Key    Address Qualification
0     Jai   27  K0  Allahabad           MCA
1  Princi   24  K1        NaN           NaN
2  Gaurav   22  K2    Kannuaj           Phd
3    Anuj   32  K3  Allahabad          Bcom

#Joining singly-indexed DataFrame with multi-indexed DataFrame :

In [49]:
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Princi', 'Gaurav'], 
        'Age':[27, 24, 22]} 
    
# Define a dictionary containing employee data 
data2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kanpur'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']} 
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1, index=pd.Index(['K0', 'K1', 'K2'], name='key'))
 
index = pd.MultiIndex.from_tuples([('K0', 'Y0'), ('K1', 'Y1'),
                                   ('K2', 'Y2'), ('K2', 'Y3')],
                                   names=['key', 'Y'])
  
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index= index)
 
 
print(df, "\n\n", df1)

       Name  Age
key
K0      Jai   27
K1   Princi   24
K2   Gaurav   22

           Address Qualification
key Y
K0  Y0  Allahabad           MCA
K1  Y1    Kannuaj           Phd
K2  Y2  Allahabad          Bcom
    Y3     Kanpur        B.hons

In [50]:
# joining singly indexed with
# multi indexed
result = df.join(df1, how='inner')
 
result

          Name  Age    Address Qualification
key Y
K0  Y0     Jai   27  Allahabad           MCA
K1  Y1  Princi   24    Kannuaj           Phd
K2  Y2  Gaurav   22  Allahabad          Bcom
    Y3  Gaurav   22     Kanpur        B.hons